_protected/controllers/LeaveApplicationController.php

INSERT INTO [Payroll_leave_application] ([EmpID], [type_leave], [date_from], [date_to], [status], [date_created], [date_updated]) VALUES ('4334-5', 'LEC_UGSLHAWP', '2019-09-16 13:00', '2019-09-18 14:00', 1, '2019-10-02 11:07:06', '2019-10-02 11:07:06')
---
    public function actionCreate()
    {
        $model = new LeaveApplication();

        if ($model->load(Yii::$app->request->post())) {

            $model->status =LeaveApplication::STATUS_PENDING;
            $model->date_created = date('Y-m-d H:i:s');
            $model->date_updated = date('Y-m-d H:i:s');
            if($model->save())

SELECT * FROM [Payroll_leave_application] WHERE ([date_to]='2019-09-18 14:00') AND ([EmpID]='4334-5')
---
    protected function findModel($date_to, $EmpID)
    {
        if (($model = LeaveApplication::findOne(['date_to' => $date_to, 'EmpID' => $EmpID])) !== null) {