_protected/views/leave-application/_form.php

SELECT * FROM [Payroll_type_leave] WHERE [type]=1
---
    <?= $form->field($model, 'EmpID')->textInput(['maxlength' => true]) ?>


    <?= $form->field($model, "type_leave")->dropDownList(ArrayHelper::map(TypeLeave::find()->where(['type'=>1])->all(), 'id', 'description'),['prompt'=>'Select Leave', 'class'=>'form-control'
                ]) ?>